[
  {
    "url": "https://community.sourcegraph.com/t/updating-cody-search-index-hangs-forever/2275",
    "title": "Troubleshooting updating cody search index... hangs forever",
    "answer": "I have been on this for two weeks. Now, I believe it is not directly related to Cody. I had Python Extension deactivated, and activating it fixed the problem."
  },
  {
    "url": "https://community.sourcegraph.com/t/claude-3-7-sonnet-does-not-show-in-model-list-es-plan/2259",
    "title": "Troubleshooting claude 3.7 sonnet does not show in model list es plan",
    "answer": "Hey @vbvictor All models available on Pro will be rollout out gradually to Enterprise Starters. The team is already aware of it and working on it. Sorry for the inconvenience."
  },
  {
    "url": "https://community.sourcegraph.com/t/security-question/2115",
    "title": "Troubleshooting security question",
    "answer": "As far as I know then if you are using your own API key and model configuration with cody.dev.models then request is directly made to your provider. Of course, maybe some additional processing may happen in the background to fetch the context and send some telemetry data but overall the processed pr&hellip;"
  },
  {
    "url": "https://community.sourcegraph.com/t/vscode-extension-not-working-in-ssh-remote-connection/1834",
    "title": "Troubleshooting vscode extension not working in ssh remote connection",
    "answer": "Hi, I have found a work-a-round that works for me: I patched the package.json of sourcegraph.sourcegraph and set “extensionKind”: [ “ui” ], and then reinstalled the extension. When I now establish a remote connection, Sourcegraph code search works fine with the local settings also in the remote wor&hellip;"
  },
  {
    "url": "https://community.sourcegraph.com/t/hitting-limits-due-to-model-switching/2200",
    "title": "Troubleshooting hitting limits due to model switching",
    "answer": "Update: My ban was overturned. It appears that was related to “problematic code”. Below is the reply I received: Thank you for contacting Sourcegraph. Based on reports, feedback, and reports we got, we strongly suspect that we have done some over-banning and are working to correct that by rollin&hellip;"
  },
  {
    "url": "https://community.sourcegraph.com/t/change-the-plan/2315",
    "title": "Troubleshooting change the plan",
    "answer": "I got a message back. What we can do is cancel the subscription and you need to resubscribe. What do you think?"
  },
  {
    "url": "https://community.sourcegraph.com/t/extremely-laggy-in-vscode/1792",
    "title": "Troubleshooting extremely laggy in vscode",
    "answer": "You can delete the entire chat in the chat history tab and there is a trash bin symbol at the top “Delete All”"
  },
  {
    "url": "https://community.sourcegraph.com/t/error-403-workspaces-forbidden-user-is-banned/2438",
    "title": "Troubleshooting error: 403 workspaces forbidden user is banned",
    "answer": "Hey @serverside-is in this case, please contact support@sourcegraph.com via e-mail for further clarification, since have no access to this data. They can help you better there than here."
  }
]